books/RealAnalysis.org
#+TITLE: Real Analysis: Measure Theory, Integration, and Hilbert Spaces
#+AUTHOR: Elias M. Stein & Rami Shakarchi
#+LATEX_HEADER: \input{preamble.tex}
#+EXPORT_FILE_NAME: ../latex/RealAnalysis/RealAnalysis.tex
#+STARTUP: content hideblocks latexpreview

* Measure Theory
** Preliminaries
   The *norm* of $x$ is denoted by $\abs{x}$ and is defined to be the standard
   Euclidean norm given by
   \begin{equation*}
   \abs{x}=(x_1^2+\dots+x_d^2)^{1/2}
   \end{equation*}
   
   The *distance* between two points $x$ and $y$ is then simply $\abs{x-y}$

   The *distance* between two sets $E$ and $F$ is defined by
   \begin{equation*}
   d(E,F=\inf\abs{x-y})
   \end{equation*}
   where the infimum is taken over all $x\in E$ and $y\in F$

   The *open ball* in $\R^d$ centered at $x$ and of radius $r$ is defined by
   \begin{equation*}
   B_r(x)=\{y\in\R^d:\abs{y-x}<r\}
   \end{equation*}
   A subset $E\subset\R^d$ is *open* if for every $x\in E$, there exists $r>0$
   with $B_r(x)\subset E$. A set is *closed* if its complement is open.

   A set $E$ is *bounded* if it's contained in some ball of finite radius. A
   bounded set is *compact* if it's also closed. Compact sets enjoy the
   Heine-Borel covering property:
   * Assume $E$ is compact, $E\subset\bigcup_\alpha\calo_\alpha$, and each
     $\calo_\alpha$ is open. Then there are finitely many of the open sets
     $\calo_{\alpha_1},\dots,\calo_{\alpha_N}$ s.t.
     $E\subset\bigcup_{j=1}^N\calo_{\alpha_j}$ 

     
   #+ATTR_LATEX: :options []
   #+BEGIN_lemma
   label:lemma1.2
   If $R,R_1,\dots,R_N$ are rectangles, and $R\subset\bigcup_{k=1}^NR_k$, then
   \begin{equation*}
   \abs{R}\le \displaystyle\sum_{k=1}^N\abs{R_k}
   \end{equation*}
   #+END_lemma

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   Every open subset $\calo$ of $\R$ can be written uniquely as a countable
   union of disjoint open intervals
   #+END_theorem
   #+BEGIN_proof
   For every $x\in\calo$, let
   \begin{equation*}
   a_x=\inf\{a<x:(a,x)\subset\calo\}\quad b_x=\sup\{b>x:(x,b)\subset\calo\}
   \end{equation*}
   and $I_x=(a_x,b_x)$. Then $\calo=\bigcup_{x\in\calo}I_x$. Now suppose that
   two intervals $I_x$ and $I_y$ intersects. Then $(I_x\cup I_y)\subset I_x$ and
   $(I_x\cup I_y)\subset I_x$. This can happen only if $I_x=I_y$. Therefore any
   two disjoint intervals in the collection $\cali=\{I_x\}_{x\in\calo}$. Since
   every open interval $I_x$ contains a rational number.
   #+END_proof

   #+ATTR_LATEX: :options []
   #+BEGIN_theorem
   label:thm1.4
   Every open subset $\calo$ of $\R^d$, $d\ge 1$, can be written as a countable
   union of almost disjoint closed cubes.
   #+END_theorem
