latex/RealAnalysis/RealAnalysis.tex
\subsection{The exterior measure}
\label{sec:orgd577f35}
\begin{definition}[]
If \(E\) is \emph{any} subset of \(\R^d\), the \textbf{exterior measure} of \(E\) is
\begin{equation*}
m_*(E)=\inf \displaystyle\sum_{j=1}^\infty\abs{Q_j}
\end{equation*}
   where the infimum is taken over all countable coverings
   \(E\subset\bigcup_{j=1}^\infty Q_j\) by closed cubes
.
\end{definition}
\begin{examplle}[]
The exterior measure of a point is zero. This is clear once we observe that a
point is a cube with volume zero.
\end{examplle}

\begin{examplle}[]
The exterior measure of a closed cube is equal to its volume. Indeed suppose
\(Q\) is a closed cube in \(\R^d\). Since \(Q\) covers itself, we must have
\(m_*(Q)\le\abs{Q}\). Therefore, it suffices to prove the reverse inequality.

We consider an arbitrary covering \(Q\subset\bigcup_{j=1}^\infty Q_j\) by
cubes, and note that it suffices to prove that
\begin{equation*}
\abs{Q}\le \displaystyle\sum_{j=1}^\infty\abs{Q_j}
\end{equation*}

For a fixed \(\epsilon>0\) we choose for each \(j\) an open cube \(S_j\) which
contains \(Q_j\) and s.t. \(\abs{S_j}\le(1+\epsilon)\abs{Q_j}\). From the open
covering \(\bigcup_{j=1}^\infty S_j\) of the compact set \(Q\), we may select a
finite subcovering which, after possibly renumbering the rectangles, we may
write as \(Q\subset\bigcup_{j=1}^NS_j\). We may apply Lemma \ref{lemma1.2} to
conclude that \(\abs{Q}\le\sum_{j=1}^N\abs{S_j}\). Consequently,
\begin{equation*}
\abs{Q}\le(1+\epsilon)\displaystyle\sum_{j=1}^N\abs{Q_j}\le(1+\epsilon)
\displaystyle\sum_{j=1}^\infty\abs{Q_j}
\end{equation*}
Since \(\epsilon\) is arbitrary, the inequality holds; thus \(\abs{Q}\le m_*(Q)\)
\end{examplle}

\begin{examplle}[]
If \(Q\) is an open cube, the result \(m_*(Q)=\abs{Q}\) still holds. Since \(Q\) is
covered by its closure \(\overline{Q}\) and \(\abs{\overline{Q}}=\abs{Q}\), we
immediately see that \(m_*(Q)\le\abs{Q}\). Note that if \(Q_0\) is a closed cube
contained in \(Q\), then \(m_*(Q_0)\le m_*(Q)\), since any covering of \(Q\) by a
countable number of closed cubes is also a covering of \(Q_0\). Hence
\(\abs{Q_0}\le m_*(Q)\), and since we can choose \(Q_0\) with a volume as close
as we wich to \(\abs{Q}\), we must have \(\abs{Q}\le m_*(Q)\)
\end{examplle}

\begin{examplle}[]
The exteriormeasure of a rectangle \(R\) is equal to its volume. To obtain
\(\abs{R}\le m_*(R)\), consider a grid in \(\R^d\) formed by cubes of side length
\(1/k\). Then if \(\calq\) consists of the (finite) collection of all cubes entirely
contained in \(R\), and \(\calq'\) the (fintie) collection of all cubes that
intersect the complement of \(R\), we first note that
\(R\subset\bigcup_{Q\in(\calq\cup\calq')}Q\). Also a simple argument yields
\begin{equation*}
\displaystyle\sum_{Q\in\calq}\abs{Q}\le\abs{R}
\end{equation*}
Moreover, there are \(O(k^{d-1})\) cubes in \(\calq'\) and these cubes have
volume \(k^{-d}\), so that \(\sum_{Q\in\calq'}\abs{Q}=O(1/k)\). Hence
\begin{equation*}
\displaystyle\sum_{Q\in\calq\cup\calq'}\abs{Q}\le\abs{R}+O(1/k)
\end{equation*}
and letting \(k\) tend to infinity yields \(m_*(R)\le\abs{R}\)
\end{examplle}

\begin{examplle}[]
The exterior measure of \(\R^d\) is infinite. This follows from the fact that
any covering of \(\R^d\) is also a covering of any cube \(Q\subset\R^d\) hence
\(\abs{Q}\le m_*(\R^d)\).
\end{examplle}

\begin{examplle}[]
The Cantor set \(\calc\) has exterior measure 0. From the construction of
\(\calc\), we know that \(\calc\subset C_k\), where each \(C_k\) is a dijoint union
of \(2^k\) closed intervals, each of length \(3^{-k}\). Consequently,
\(m_*(\calc)\le(2/3)^k\) for all \(k\), hence \(m_*(\calc)=0\)
\end{examplle}


\begin{proposition}
For every \(\epsilon>0\), there exists a covering \(E\subset\bigcup_{j=1}^\infty
   Q_j\) with
\begin{equation*}
\displaystyle\sum_{j=1}^\infty m_*(Q_j)\le m_*(E)+\epsilon
\end{equation*}
\end{proposition}

\begin{proposition}[Monotonicity]
If \(E_1\subset E_2\), then \(m_*(E_1)\le m_*(E_2)\)
\end{proposition}

\begin{proposition}[Countable sub-additivity]
\label{ob2}
If \(E=\bigcup_{j=1}^\infty E_j\), then \(m_*(E)\le\sum_{j=1}^\infty m_*(E_j)\)
\end{proposition}
\begin{proof}
First we may assume that each \(m_*(E_j)<\infty\) for otherwise the inequality
clearly holds. For any \(\epsilon>0\) the definition of the exterior measure
yields for each \(j\) a covering \(E_j\subset\bigcup_{k=1}^\infty Q_{k,j}\) by
closed cubes with
\begin{equation*}
\displaystyle\sum_{k=1}^\infty\abs{Q_{k,j}}\le m_*(E_j)+\frac{\epsilon}{2^j}
\end{equation*}
Then, \(E\subset\bigcup_{j,k=1}^\infty Q_{k,j}\) is a covering of \(E\) by closed
cubes and therefore
\begin{align*}
m_*(E)\le \displaystyle\sum_{j,k}\abs{Q_{k,j}}=&\displaystyle\sum_{j=1}^\infty
\displaystyle\sum_{k=1}^\infty\abs{Q_{k,j}}\\
&\le \displaystyle\sum_{j=1}^\infty(m_*(E_j)+\frac{\epsilon}{2^j})\\
&=\displaystyle\sum_{j=1}^\infty m_*(E_j)+\epsilon
\end{align*}
\end{proof}

\begin{proposition}[]
\label{ob3}
If \(E\subset\R^d\), then \(m_*(E)=\inf m_*(\calo)\) where the infimum is taken
over all open sets \(\calo\) containing \(E\)
\end{proposition}

\begin{proof}
By monotonicity, it is clear that \(m_*(E)\le\inf m_*(\calo)\) holds. For the
reverse inequality, let \(\epsilon>0\) and choose cubes \(Q_j\) s.t.
\(E\subset\bigcup_{j=1}^\infty Q_j\) with
\begin{equation*}
\displaystyle\sum_{j=1}^\infty\abs{Q_j}\le m_*(E)+\frac{\epsilon}{2}
\end{equation*}

Let \(Q_j^0\) denote an open cube containing \(Q_j\), and s.t. 
\(\abs{Q_j^0}\le\abs{Q_j}+\frac{\epsilon}{2^{j+1}}\). Then 
\(\calo=\bigcup_{j=1}^\infty Q_j^0\) is open, and by Proposition \ref{ob2}
\begin{align*}
m_*(\calo)\le \displaystyle\sum_{j=1}^\infty m_*(Q_j^0)&=
\displaystyle\sum_{j=1}^\infty\abs{Q_j^0}\\
&\le \displaystyle\sum_{j=1}^\infty(\abs{Q_j}+\frac{\epsilon}{2^{j+1}})\\
&\le \displaystyle\sum_{j=1}^\infty\abs{Q_j}+\frac{\epsilon}{2}\\
&\le m_*(E)+\epsilon
\end{align*}
\end{proof}

\begin{proposition}[]
\label{ob4}
If \(E=E_1\cup E_2\) and \(d(E_1,E_2)>0\), then
\begin{equation*}
m_*(E)=m_*(E_1)+m_*(E_2)
\end{equation*}
\end{proposition}

\begin{proof}
By Proposition \ref{ob2}, we already know that \(m_*(E)\le m_*(E_1)+m_*(E_2)\).
First select \(d(E_1,E_2)>\delta>0\). Next we choose a covering
\(E\subset\bigcup_j=1^\infty Q_j\) by closed cubes with 
\(\sum_{j=1}^\infty\abs{Q_j}\le m_*(E)+\epsilon\). We may, after subdividing
the cubes \(Q_j\), assume that each \(Q_j\) has a diameter less than \(\delta\). In
this case, each \(Q_j\) can intersect at most one of the two sets \(E_1\) or
\(E_2\). If we denote by \(J_1\) and \(J_2\) the sets of those indices \(j\) for
which \(Q_j\) intersects \(E_1\) and \(E_2\), respectively, then \(J_1\cap J_2\) is
empty, and we have
\begin{equation*}
E_1\subset \displaystyle\bigcap_{j\in J_1}^\infty Q_j\quad
\text{ as well as }\quad
E_2\subset \displaystyle\bigcap_{j\in J_2}^\infty Q_j
\end{equation*}
Therefore, 
\begin{align*}
m_*(E_1)+m_*(E_2)&\le \displaystyle\sum_{j\in J_1}\abs{Q_j}+
\displaystyle\sum_{j\in J_2}\abs{Q_j}\\
&\le \displaystyle\sum_{j=1}^\infty\abs{Q_j}\\
&\le m_*(E)+\epsilon
\end{align*}
\end{proof}

\begin{proposition}[]
If a set \(E\) is the countable union of almost disjoint cubes
\(E=\bigcup_{j=1}^\infty Q_j\), then
\begin{equation*}
m_*(E)=\displaystyle\sum_{j=1}^\infty\abs{Q_j}
\end{equation*}
\end{proposition}

\begin{proof}
Let \(\tilde{Q}_j\) dentoe a cube strictly contained in \(Q_j\) s.t.
\(\abs{Q_j}\le\abs{\tidle{Q}_j}+\epsilon/2^{j}\), where \(\epsilon\) is arbitrary
but fixed. Then for every \(N\), the cubes \(\tilde{Q}_1,\dots,\tilde{Q}_N\) are
disjoint, hence at a finite distance from one another, and repeated 
applications of Proposition \ref{ob4} imply
\begin{equation*}
m_*(\displaystyle\bigcup_{j=1}^N\tilde{Q}_j)=\displaystyle\sum_{j=1}^N
\abs{\tilde{Q}_j}\ge \displaystyle\sum_{j=1}^N(\abs{Q_j}-\epsilon/2^j)
\end{equation*}
Since \(\bigcup_{j=1}^N\tilde{Q}_j\subset E\), we conclude that for every
integer \(N\),
\begin{equation*}
m_*(E)\ge \displaystyle\sum_{j=1}^N\abs{Q_j}-\epsilon
\end{equation*}
In the limit as \(N\) tends to infinity we deduce
\(\sum_{j=1}^\infty\abs{Q_j}\le m_*(E)+\epsilon\) for every \(\epsilon>0\)
\end{proof}
