latex/RealAnalysis/RealAnalysis.tex
\subsection{Measurable sets and the Lebesgue measure}
\label{sec:org34cb8ba}
\begin{definition}[]
A subset \(E\) of \(\R^d\) is \textbf{Lebesgue measurable} or simply \textbf{measurable}, if for
any \(\epsilon>0\) there exists an open set \(\calo\) with \(E\subset\calo\) and
\begin{equation*}
m_*(\calo-E)\le\epsilon
\end{equation*}

If \(E\) is measurable, we define its \textbf{Lebesgue measure} (or \textbf{measure}) \(m(E)\) by
\begin{equation*}
m(E)=m_*(E)
\end{equation*}
\end{definition}

\begin{proposition}[]
Every open set in \(\R^d\) is measurable
\end{proposition}
\begin{proof}
\(m_*(E-E)=0\le\epsilon\)
\end{proof}

\begin{proposition}[]
If \(m_*(E)=0\), then \(E\) is measurable. In particular, if \(F\) is a subset of a
set of exterior measure 0, then \(F\) is measurable.
\end{proposition}
\begin{proof}
By proposition \ref{ob3}, for every \(\epsilon>0\) there exists an open set
\(\calo\) with \(E\subset\calo\) and \(m_*(\calo)\le\epsilon\). Since
\((\calo-E)\subset\calo\), monotonicity implies \(m_*(\calo-E)\le\epsilon\)
\end{proof}

As a consequence, the Cantor set \(\calc\) is measurable.

\begin{proposition}[]
\label{prop3}
A countable union of measurable sets is measurable
\end{proposition}

\begin{proof}
Suppose \(E=\bigcup_{j=1}^\infty E_j\) where each \(E_j\) is measurable. Given
\(\epsilon>0\), we may choose for each \(j\) an open set \(\calo_j\) with
\(E_j\subset\calo_j\) and \(m_*(\calo_j-E_j)\le\epsilon/2^j\). Then the union 
\(\calo=\bigcup_{j=1}^\infty\calo_j\) is open, \(E\subset\calo\) and 
\(\calo-E\subset\bigcup_{j=1}^\infty(\calo_j-E_j)\), so monotonicity and
sub-additivity of the exterior measure imply
\begin{equation*}
m_*(\calo-E)\le \displaystyle\sum_{j=1}^\infty m_*(\calo_j-E_j)\le\epsilon
\end{equation*}
\end{proof}

\begin{proposition}[]
Closed sets are measurable
\end{proposition}
\begin{proof}
First we observe that it suffices to prove that compact sets are measurable.
Indeed any closed set \(F\) can be written as the union of compact sets, say 
\(F=\bigcup_{k=1}^\infty F\cap B_k\), where \(B_k\) denotes the closed ball of
radius \(k\) centered at the origin; then Proposition \ref{prop3} applies.

So suppose \(F\) is compact (so that in particular \(m_*(F)<\infty\)), and let
\(\epsilon>0\). By Proposition \ref{ob3} we can select an open set \(\calo\) with
\(F\subset\calo\) and \(m_*(\calo)\le m_*(F)+\epsilon\). Since \(F\) is closed, the
difference \(\calo-F\) is open, and by Theorem \ref{thm1.4} we may write this
difference as countable union of almost disjoint cubes
\begin{equation*}
\calo-F=\displaystyle\bigcup_{j=1}^\infty Q_j
\end{equation*}
For a fixed \(N\), the finite union \(K=\bigcup_{j=1}^N Q_j\) is compact;
therefore \(d(K,F)>0\). Since \((K\cup F)\subset\calo\)
\begin{align*}
m_*(\calo)&\ge m_*(F)+m_*(K)\\
&=m_*(F)+\displaystyle\sum_{j=1}^Nm_*(Q_j)
\end{align*}

Hence \(\sum_{j=1}^Nm_*(Q_j)\le m_*(\calo)-m_*(F)\le\epsilon\), and this also
holds in the limit as \(N\) tends to be infinite. Hence
\begin{equation*}
m_*(\calo-F)\le \displaystyle\sum_{j=1}^\infty m_*(Q_j)\le\epsilon
\end{equation*}
\end{proof}

\begin{lemma}[]
If \(F\) is closed, \(K\) is compact, and these sets are disjoint, then \(d(F,K)>0\)
\end{lemma}
\begin{proof}
Since \(F\) is closed, for each point \(x\in K\), there exists \(\delta_x>0\) so
that \(d(x,F)>3\delta_x\). Since \(\bigcup_{x\in K}B_{2\delta_x}(x)\) covers \(K\),
and \(K\) is compact, we may find a subcover, which we denote by
\(\bigcup_{j=1}^NB_{2\delta_j}(x_j)\). If we let
\(\delta=\min(\delta_1,\dots,\delta_N)\), then we must have
\(d(K,F)\ge\delta>0\). Indeed, if \(x\in K\) and \(y\in F\), then for some \(j\) we
have \(\abs{x_j-x}\le 2\delta_j\) and by construction
\(\abs{y-x_j}\ge3\delta_j\). Therefore
\begin{equation*}
\abs{y-x}\ge\abs{y-x_j}-\abs{x_j-x}\ge3\delta_j-2\delta_j\ge\delta
\end{equation*}
\end{proof}

\begin{proposition}[]
The complement of a measurable set is measurable
\end{proposition}

\begin{proof}
If \(E\) is measurable, then for every positive integer \(n\) we may choose an
open set \(\calo_n\) with \(E\subset\calo_n\) and \(m_*(\calo_n-E)\le1/n\). The
complement \(\calo_n^c\) is closed, hence measurable, which implies that the
union \(S=\bigcup_{n=1}^\infty\calo_n^c\) is also measurable. Now we simply
note that \(S\subset E^c\) and
\begin{equation*}
(E^c-S)\subset(\calo_n-E)
\end{equation*}
s.t. \(m_*(E^c-S)\le1/n\) for all \(n\). Therefore \(m_*(E^c-S)=0\) and \(E^c-S\) is
measurable. Hence \(E^c=S\cup(E^c-S)\) is measurable
\end{proof}

\begin{proposition}[]
A countable intersection of measurable sets is measurable
\end{proposition}
\begin{proof}
\begin{equation*}
\displaystyle\bigcap_{j=1}^\infty E_j=(\displaystyle\bigcup_{j=1}^\infty E_j^c)^c
\end{equation*}
\end{proof}
\end{document}